{
  "Portfolio": [
    {
      "title": "New Projects",
      "text": "<strong>Description:</strong><br /><br /> A comprehensive stacking and liquidity management dashboard for the Archway project, a blockchain ecosystem built on CosmWasm. This innovative dashboard empowers users to participate in the Archway network by staking coins and providing liquidity through a variety of smart contracts. <br /><br /><strong>Key Features:</strong><br /><br /> - <strong>Stacking and Liquidity Management:</strong> The platform provides users with a user-friendly interface to stake their coins and provide liquidity using different smart contracts within the Archway network. Users have the flexibility to choose which contract and coin they want to stake, supporting the Archway network while promoting their chosen contract.<br /><br /> - <strong>CosmWasm Wallet Integration:</strong> To streamline the user experience, I integrated a CosmWasm wallet directly into the user's web browser. This enables seamless and secure transactions, making it easy for users to manage their assets and interact with the Archway network. <br /><br /> - <strong>Network Statistics:</strong> The dashboard includes a robust set of tools for users to access network statistics. Users can track the performance and activity of different contracts and wallets within the Archway ecosystem. This data empowers users with valuable insights to make informed decisions",
      "photos": [
        "archway-app.jpeg",
        "archway-app.jpeg",
        "ether_logo.jpeg"
      ]
    },
    {
      "title": "Active Projects",
      "text": "<strong>Description:</strong><br /><br /> An advanced smart contract designed for Ethereum EVM networks. This smart contract employs 'Submarine Sends' to protect against front-running attacks, enhancing transaction privacy and security.<br /><br /><strong>Key Features:</strong><br /><br /> <strong>Front Running Protection:</strong> Submarine Sends prevent front-running attacks, a common concern in Ethereum and EVM-based networks <br /><br /> <strong>Stealthy Blockchain Account:</strong> It creates a stealthy blockchain account for secure fund transfers.<br /><br /> <strong>Delayed Transaction Reveal:</strong> The contract executes transactions with zero value and unfamiliar data, making it immune to front-running.<br /><br /> <strong>Gas Fee Reduction:</strong> The contract includes a self-destruct method, reducing transaction gas fees. <br /><br /> <strong>DEX Swaps:</strong> Capable of DEX swaps at the current market price, eliminating slippage concerns. <br /><br /> This project showcases the expertise in smart contract development and blockchain security, making it a valuable addition to the portfolio.",
      "photos": [
        "archway-app.jpeg",
        "archway-app.jpeg",
        "ether_logo.jpeg"
      ]
    },
    {
      "title": "Showcase Projects",
      "text": "<strong>Description:</strong><br /><br />A comprehensive software for automating retro drops hunt activities and managing operations across various Layer 2 (L2) networks, including Arbitrum NOVA, StarkNet, ZK-Sync, ZK-Sync ERA, and APTOS.<br /><br /> <strong>Key Features:</strong> <br /><br /> <strong>Diverse L2 Network Support:</strong> The software facilitates swaps, liquidity provision, NFT minting, and other activities on multiple L2 networks, enhancing user flexibility and engagement.<br /><br /> <strong>Layer ZERO Integration:</strong> Beyond L2, the software enables seamless swaps between different L2 chains, extending its functionality to Layer ZERO projects. <br /><br /> <strong>Dual Performance Modes:</strong> The software operates in two distinct modes. The first handles straightforward activities using existing account balances, while the second, accounts boosting, efficiently manages funds by collecting them at OKX exchange and distributing them to accounts as needed. Once activities are completed, funds are returned to OKX for the next account in line. <br /><br /> <strong>Flexible Configuration:</strong> Users have the power to fine-tune their experience, customizing settings for the number of accounts managed, the use of account balances, and the adjustment of hunting strategies through contract additions or deletions. This flexibility allows for diversified activities and unique account configurations. <br /><br /> <strong>Privacy Protection:</strong> To ensure account anonymity, the software employs advanced privacy technologies similar to those found in AdsPower software, safeguarding accounts against de-anonymization threats. <br /><br /> This project underscores the proficiency in software development for blockchain automation, L2 network management, and privacy protection, establishing it as a valuable asset in the portfolio",
      "photos": [
        "archway-app.jpeg",
        "archway-app.jpeg",
        "ether_logo.jpeg"
      ]
    }
  ]
}
